<a href="https://colab.research.google.com/github/yoonyoung27/prac_class/blob/main/personal_project_M1F4_%EC%A7%80%EC%9C%A4%EC%98%81.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#신용카드 사용자 연체 예측 AI 경진대회

https://www.dacon.io/competitions/official/235713/overview/description/

###✓ Ready for dataset

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [4]:
import pandas as pd

In [9]:
user_test = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/test.csv')
user_test.head()

   index gender car reality  ...  email  occyp_type family_size begin_month
0  26457      M   Y       N  ...      0         NaN         2.0       -60.0
1  26458      F   N       Y  ...      0  Core staff         2.0       -36.0
2  26459      F   N       Y  ...      0    Laborers         2.0       -40.0
3  26460      M   Y       N  ...      0     Drivers         2.0       -41.0
4  26461      F   Y       Y  ...      0    Managers         2.0        -8.0

[5 rows x 19 columns]

In [10]:
user_train = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/train.csv')
user_train.head()

   index gender car reality  ...   occyp_type  family_size begin_month credit
0      0      F   N       N  ...          NaN          2.0        -6.0    1.0
1      1      F   N       Y  ...     Laborers          3.0        -5.0    1.0
2      2      M   Y       Y  ...     Managers          2.0       -22.0    2.0
3      3      F   N       Y  ...  Sales staff          2.0       -37.0    0.0
4      4      F   Y       Y  ...     Managers          2.0       -26.0    2.0

[5 rows x 20 columns]